grevaillot/svd_tools/headers/STM32H750x/sai3.h
#define SAI3_SAI_ASLOTR_NBSLOT_SHIFT		8
#define SAI3_SAI_ASLOTR_NBSLOT_MASK		0x0f
/** @defgroup sai3_sai_aslotr_nbslot NBSLOT Number of slots in an audio frame. These bits are set and cleared by software. The value set in this bitfield represents the number of slots + 1 in the audio frame (including the number of inactive slots). The maximum number of slots is 16. The number of slots should be even if FSDEF bit in the SAI_xFRCR register is set. The number of slots must be configured when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


#define SAI3_SAI_ASLOTR_SLOTSZ_SHIFT		6
#define SAI3_SAI_ASLOTR_SLOTSZ_MASK		0x03
/** @defgroup sai3_sai_aslotr_slotsz SLOTSZ Slot size This bits is set and cleared by software. The slot size must be higher or equal to the data size. If this condition is not respected, the behavior of the SAI will be undetermined. Refer to Section: Output data line management on an inactive slot for information on how to drive SD line. These bits must be set when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


#define SAI3_SAI_ASLOTR_FBOFF_SHIFT		0
#define SAI3_SAI_ASLOTR_FBOFF_MASK		0x1f
/** @defgroup sai3_sai_aslotr_fboff FBOFF First bit offset These bits are set and cleared by software. The value set in this bitfield defines the position of the first data transfer bit in the slot. It represents an offset value. In transmission mode, the bits outside the data field are forced to 0. In reception mode, the extra received bits are discarded. These bits must be set when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai3_sai_aim SAIAIM Interrupt mask register 2
@{*/

/** SAI3_SAI_AIM_LFSDETIE Late frame synchronization detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt will be generated if the LFSDET bit is set in the SAI_xSR register. This bit is meaningless in AC97, SPDIF mode or when the audio block operates as a master. **/
#define SAI3_SAI_AIM_LFSDETIE		(1 << 6)
/** SAI3_SAI_AIM_AFSDETIE Anticipated frame synchronization detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt will be generated if the AFSDET bit in the SAI_xSR register is set. This bit is meaningless in AC97, SPDIF mode or when the audio block operates as a master. **/
#define SAI3_SAI_AIM_AFSDETIE		(1 << 5)
/** SAI3_SAI_AIM_CNRDYIE Codec not ready interrupt enable (AC97). This bit is set and cleared by software. When the interrupt is enabled, the audio block detects in the slot 0 (tag0) of the AC97 frame if the Codec connected to this line is ready or not. If it is not ready, the CNRDY flag in the SAI_xSR register is set and an interruption i generated. This bit has a meaning only if the AC97 mode is selected through PRTCFG[1:0] bits and the audio block is operates as a receiver. **/
#define SAI3_SAI_AIM_CNRDYIE		(1 << 4)
/** SAI3_SAI_AIM_FREQIE FIFO request interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the FREQ bit in the SAI_xSR register is set. Since the audio block defaults to operate as a transmitter after reset, the MODE bit must be configured before setting FREQIE to avoid a parasitic interruption in receiver mode, **/
#define SAI3_SAI_AIM_FREQIE		(1 << 3)
/** SAI3_SAI_AIM_WCKCFGIE Wrong clock configuration interrupt enable. This bit is set and cleared by software. This bit is taken into account only if the audio block is configured as a master (MODE[1] = 0) and NODIV = 0. It generates an interrupt if the WCKCFG flag in the SAI_xSR register is set. Note: This bit is used only in TDM mode and is meaningless in other modes. **/
#define SAI3_SAI_AIM_WCKCFGIE		(1 << 2)
/** SAI3_SAI_AIM_MUTEDETIE Mute detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the MUTEDET bit in the SAI_xSR register is set. This bit has a meaning only if the audio block is configured in receiver mode. **/
#define SAI3_SAI_AIM_MUTEDETIE		(1 << 1)
/** SAI3_SAI_AIM_OVRUDRIE Overrun/underrun interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the OVRUDR bit in the SAI_xSR register is set. **/
#define SAI3_SAI_AIM_OVRUDRIE		(1 << 0)

/**@}*/

/** @defgroup sai3_sai_asr SAIASR Status register
@{*/


#define SAI3_SAI_ASR_FLVL_SHIFT		16
#define SAI3_SAI_ASR_FLVL_MASK		0x07
/** @defgroup sai3_sai_asr_flvl FLVL FIFO level threshold. This bit is read only. The FIFO level threshold flag is managed only by hardware and its setting depends on SAI block configuration (transmitter or receiver mode). If the SAI block is configured as transmitter: If SAI block is configured as receiver:
@{*/
/**@}*/

/** SAI3_SAI_ASR_LFSDET Late frame synchronization detection. This bit is read only. This flag can be set only if the audio block is configured in slave mode. It is not used in AC97 or SPDIF mode. It can generate an interrupt if LFSDETIE bit is set in the SAI_xIM register. This flag is cleared when the software sets bit CLFSDET in SAI_xCLRFR register **/
#define SAI3_SAI_ASR_LFSDET		(1 << 6)
/** SAI3_SAI_ASR_AFSDET Anticipated frame synchronization detection. This bit is read only. This flag can be set only if the audio block is configured in slave mode. It is not used in AC97or SPDIF mode. It can generate an interrupt if AFSDETIE bit is set in SAI_xIM register. This flag is cleared when the software sets CAFSDET bit in SAI_xCLRFR register. **/
#define SAI3_SAI_ASR_AFSDET		(1 << 5)
/** SAI3_SAI_ASR_CNRDY Codec not ready. This bit is read only. This bit is used only when the AC97 audio protocol is selected in the SAI_xCR1 register and configured in receiver mode. It can generate an interrupt if CNRDYIE bit is set in SAI_xIM register. This flag is cleared when the software sets CCNRDY bit in SAI_xCLRFR register. **/
#define SAI3_SAI_ASR_CNRDY		(1 << 4)
/** SAI3_SAI_ASR_FREQ FIFO request. This bit is read only. The request depends on the audio block configuration: If the block is configured in transmission mode, the FIFO request is related to a write request operation in the SAI_xDR. If the block configured in reception, the FIFO request related to a read request operation from the SAI_xDR. This flag can generate an interrupt if FREQIE bit is set in SAI_xIM register. **/
#define SAI3_SAI_ASR_FREQ		(1 << 3)
/** SAI3_SAI_ASR_WCKCFG Wrong clock configuration flag. This bit is read only. This bit is used only when the audio block operates in master mode (MODE[1] = 0) and NODIV = 0. It can generate an interrupt if WCKCFGIE bit is set in SAI_xIM register. This flag is cleared when the software sets CWCKCFG bit in SAI_xCLRFR register. **/
#define SAI3_SAI_ASR_WCKCFG		(1 << 2)
/** SAI3_SAI_ASR_MUTEDET Mute detection. This bit is read only. This flag is set if consecutive 0 values are received in each slot of a given audio frame and for a consecutive number of audio frames (set in the MUTECNT bit in the SAI_xCR2 register). It can generate an interrupt if MUTEDETIE bit is set in SAI_xIM register. This flag is cleared when the software sets bit CMUTEDET in the SAI_xCLRFR register. **/
#define SAI3_SAI_ASR_MUTEDET		(1 << 1)
/** SAI3_SAI_ASR_OVRUDR Overrun / underrun. This bit is read only. The overrun and underrun conditions can occur only when the audio block is configured as a receiver and a transmitter, respectively. It can generate an interrupt if OVRUDRIE bit is set in SAI_xIM register. This flag is cleared when the software sets COVRUDR bit in SAI_xCLRFR register. **/
#define SAI3_SAI_ASR_OVRUDR		(1 << 0)

/**@}*/

/** @defgroup sai3_sai_aclrfr SAIACLRFR Clear flag register
@{*/

