grevaillot/svd_tools/headers/STM32H750x/sai3.h
/** SAI3_SAI_ACLRFR_CLFSDET Clear late frame synchronization detection flag. This bit is write only. Programming this bit to 1 clears the LFSDET flag in the SAI_xSR register. This bit is not used in AC97or SPDIF mode Reading this bit always returns the value 0. **/
#define SAI3_SAI_ACLRFR_CLFSDET		(1 << 6)
/** SAI3_SAI_ACLRFR_CAFSDET Clear anticipated frame synchronization detection flag. This bit is write only. Programming this bit to 1 clears the AFSDET flag in the SAI_xSR register. It is not used in AC97or SPDIF mode. Reading this bit always returns the value 0. **/
#define SAI3_SAI_ACLRFR_CAFSDET		(1 << 5)
/** SAI3_SAI_ACLRFR_CCNRDY Clear Codec not ready flag. This bit is write only. Programming this bit to 1 clears the CNRDY flag in the SAI_xSR register. This bit is used only when the AC97 audio protocol is selected in the SAI_xCR1 register. Reading this bit always returns the value 0. **/
#define SAI3_SAI_ACLRFR_CCNRDY		(1 << 4)
/** SAI3_SAI_ACLRFR_CWCKCFG Clear wrong clock configuration flag. This bit is write only. Programming this bit to 1 clears the WCKCFG flag in the SAI_xSR register. This bit is used only when the audio block is set as master (MODE[1] = 0) and NODIV = 0 in the SAI_xCR1 register. Reading this bit always returns the value 0. **/
#define SAI3_SAI_ACLRFR_CWCKCFG		(1 << 2)
/** SAI3_SAI_ACLRFR_CMUTEDET Mute detection flag. This bit is write only. Programming this bit to 1 clears the MUTEDET flag in the SAI_xSR register. Reading this bit always returns the value 0. **/
#define SAI3_SAI_ACLRFR_CMUTEDET		(1 << 1)
/** SAI3_SAI_ACLRFR_COVRUDR Clear overrun / underrun. This bit is write only. Programming this bit to 1 clears the OVRUDR flag in the SAI_xSR register. Reading this bit always returns the value 0. **/
#define SAI3_SAI_ACLRFR_COVRUDR		(1 << 0)

/**@}*/

/** @defgroup sai3_sai_adr SAIADR Data register
@{*/


#define SAI3_SAI_ADR_DATA_SHIFT		0
#define SAI3_SAI_ADR_DATA_MASK		0xffffffff
/** @defgroup sai3_sai_adr_data DATA Data A write to this register loads the FIFO provided the FIFO is not full. A read from this register empties the FIFO if the FIFO is not empty.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai3_sai_bcr1 SAIBCR1 Configuration register 1
@{*/

/** SAI3_SAI_BCR1_OSR Oversampling ratio for master clock **/
#define SAI3_SAI_BCR1_OSR		(1 << 26)

#define SAI3_SAI_BCR1_MCKDIV_SHIFT		20
#define SAI3_SAI_BCR1_MCKDIV_MASK		0x0f
/** @defgroup sai3_sai_bcr1_mckdiv MCKDIV Master clock divider. These bits are set and cleared by software. These bits are meaningless when the audio block operates in slave mode. They have to be configured when the audio block is disabled. Others: the master clock frequency is calculated accordingly to the following formula:
@{*/
/**@}*/

/** SAI3_SAI_BCR1_NOMCK No divider **/
#define SAI3_SAI_BCR1_NOMCK		(1 << 19)
/** SAI3_SAI_BCR1_DMAEN DMA enable. This bit is set and cleared by software. Note: Since the audio block defaults to operate as a transmitter after reset, the MODE[1:0] bits must be configured before setting DMAEN to avoid a DMA request in receiver mode. **/
#define SAI3_SAI_BCR1_DMAEN		(1 << 17)
/** SAI3_SAI_BCR1_SAIXEN Audio block enable where x is A or B. This bit is set by software. To switch off the audio block, the application software must program this bit to 0 and poll the bit till it reads back 0, meaning that the block is completely disabled. Before setting this bit to 1, check that it is set to 0, otherwise the enable command will not be taken into account. This bit allows to control the state of SAIx audio block. If it is disabled when an audio frame transfer is ongoing, the ongoing transfer completes and the cell is fully disabled at the end of this audio frame transfer. Note: When SAIx block is configured in master mode, the clock must be present on the input of SAIx before setting SAIXEN bit. **/
#define SAI3_SAI_BCR1_SAIXEN		(1 << 16)
/** SAI3_SAI_BCR1_OUTDRIV Output drive. This bit is set and cleared by software. Note: This bit has to be set before enabling the audio block and after the audio block configuration. **/
#define SAI3_SAI_BCR1_OUTDRIV		(1 << 13)
/** SAI3_SAI_BCR1_MONO Mono mode. This bit is set and cleared by software. It is meaningful only when the number of slots is equal to 2. When the mono mode is selected, slot 0 data are duplicated on slot 1 when the audio block operates as a transmitter. In reception mode, the slot1 is discarded and only the data received from slot 0 are stored. Refer to Section: Mono/stereo mode for more details. **/
#define SAI3_SAI_BCR1_MONO		(1 << 12)

#define SAI3_SAI_BCR1_SYNCEN_SHIFT		10
#define SAI3_SAI_BCR1_SYNCEN_MASK		0x03
/** @defgroup sai3_sai_bcr1_syncen SYNCEN Synchronization enable. These bits are set and cleared by software. They must be configured when the audio sub-block is disabled. Note: The audio sub-block should be configured as asynchronous when SPDIF mode is enabled.
@{*/
/**@}*/

/** SAI3_SAI_BCR1_CKSTR Clock strobing edge. This bit is set and cleared by software. It must be configured when the audio block is disabled. This bit has no meaning in SPDIF audio protocol. **/
#define SAI3_SAI_BCR1_CKSTR		(1 << 9)
/** SAI3_SAI_BCR1_LSBFIRST Least significant bit first. This bit is set and cleared by software. It must be configured when the audio block is disabled. This bit has no meaning in AC97 audio protocol since AC97 data are always transferred with the MSB first. This bit has no meaning in SPDIF audio protocol since in SPDIF data are always transferred with LSB first. **/
#define SAI3_SAI_BCR1_LSBFIRST		(1 << 8)

#define SAI3_SAI_BCR1_DS_SHIFT		5
#define SAI3_SAI_BCR1_DS_MASK		0x07
/** @defgroup sai3_sai_bcr1_ds DS Data size. These bits are set and cleared by software. These bits are ignored when the SPDIF protocols are selected (bit PRTCFG[1:0]), because the frame and the data size are fixed in such case. When the companding mode is selected through COMP[1:0] bits, DS[1:0] are ignored since the data size is fixed to 8 bits by the algorithm. These bits must be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI3_SAI_BCR1_PRTCFG_SHIFT		2
#define SAI3_SAI_BCR1_PRTCFG_MASK		0x03
/** @defgroup sai3_sai_bcr1_prtcfg PRTCFG Protocol configuration. These bits are set and cleared by software. These bits have to be configured when the audio block is disabled.
@{*/
/**@}*/


#define SAI3_SAI_BCR1_MODE_SHIFT		0
#define SAI3_SAI_BCR1_MODE_MASK		0x03
/** @defgroup sai3_sai_bcr1_mode MODE SAIx audio block mode immediately
@{*/
/**@}*/


/**@}*/

/** @defgroup sai3_sai_bcr2 SAIBCR2 Configuration register 2
@{*/


#define SAI3_SAI_BCR2_COMP_SHIFT		14
#define SAI3_SAI_BCR2_COMP_MASK		0x03
/** @defgroup sai3_sai_bcr2_comp COMP Companding mode. These bits are set and cleared by software. The -Law and the A-Law log are a part of the CCITT G.711 recommendation, the type of complement that will be used depends on CPL bit. The data expansion or data compression are determined by the state of bit MODE[0]. The data compression is applied if the audio block is configured as a transmitter. The data expansion is automatically applied when the audio block is configured as a receiver. Refer to Section: Companding mode for more details. Note: Companding mode is applicable only when TDM is selected.
@{*/
/**@}*/

/** SAI3_SAI_BCR2_CPL Complement bit. This bit is set and cleared by software. It defines the type of complement to be used for companding mode Note: This bit has effect only when the companding mode is -Law algorithm or A-Law algorithm. **/
#define SAI3_SAI_BCR2_CPL		(1 << 13)

