grevaillot/svd_tools/headers/STM32H750x/sai3.h
#define SAI3_SAI_BSLOTR_SLOTSZ_SHIFT		6
#define SAI3_SAI_BSLOTR_SLOTSZ_MASK		0x03
/** @defgroup sai3_sai_bslotr_slotsz SLOTSZ Slot size This bits is set and cleared by software. The slot size must be higher or equal to the data size. If this condition is not respected, the behavior of the SAI will be undetermined. Refer to Section: Output data line management on an inactive slot for information on how to drive SD line. These bits must be set when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


#define SAI3_SAI_BSLOTR_FBOFF_SHIFT		0
#define SAI3_SAI_BSLOTR_FBOFF_MASK		0x1f
/** @defgroup sai3_sai_bslotr_fboff FBOFF First bit offset These bits are set and cleared by software. The value set in this bitfield defines the position of the first data transfer bit in the slot. It represents an offset value. In transmission mode, the bits outside the data field are forced to 0. In reception mode, the extra received bits are discarded. These bits must be set when the audio block is disabled. They are ignored in AC97 or SPDIF mode.
@{*/
/**@}*/


/**@}*/

/** @defgroup sai3_sai_bim SAIBIM Interrupt mask register 2
@{*/

/** SAI3_SAI_BIM_LFSDETIE Late frame synchronization detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt will be generated if the LFSDET bit is set in the SAI_xSR register. This bit is meaningless in AC97, SPDIF mode or when the audio block operates as a master. **/
#define SAI3_SAI_BIM_LFSDETIE		(1 << 6)
/** SAI3_SAI_BIM_AFSDETIE Anticipated frame synchronization detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt will be generated if the AFSDET bit in the SAI_xSR register is set. This bit is meaningless in AC97, SPDIF mode or when the audio block operates as a master. **/
#define SAI3_SAI_BIM_AFSDETIE		(1 << 5)
/** SAI3_SAI_BIM_CNRDYIE Codec not ready interrupt enable (AC97). This bit is set and cleared by software. When the interrupt is enabled, the audio block detects in the slot 0 (tag0) of the AC97 frame if the Codec connected to this line is ready or not. If it is not ready, the CNRDY flag in the SAI_xSR register is set and an interruption i generated. This bit has a meaning only if the AC97 mode is selected through PRTCFG[1:0] bits and the audio block is operates as a receiver. **/
#define SAI3_SAI_BIM_CNRDYIE		(1 << 4)
/** SAI3_SAI_BIM_FREQIE FIFO request interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the FREQ bit in the SAI_xSR register is set. Since the audio block defaults to operate as a transmitter after reset, the MODE bit must be configured before setting FREQIE to avoid a parasitic interruption in receiver mode, **/
#define SAI3_SAI_BIM_FREQIE		(1 << 3)
/** SAI3_SAI_BIM_WCKCFGIE Wrong clock configuration interrupt enable. This bit is set and cleared by software. This bit is taken into account only if the audio block is configured as a master (MODE[1] = 0) and NODIV = 0. It generates an interrupt if the WCKCFG flag in the SAI_xSR register is set. Note: This bit is used only in TDM mode and is meaningless in other modes. **/
#define SAI3_SAI_BIM_WCKCFGIE		(1 << 2)
/** SAI3_SAI_BIM_MUTEDETIE Mute detection interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the MUTEDET bit in the SAI_xSR register is set. This bit has a meaning only if the audio block is configured in receiver mode. **/
#define SAI3_SAI_BIM_MUTEDETIE		(1 << 1)
/** SAI3_SAI_BIM_OVRUDRIE Overrun/underrun interrupt enable. This bit is set and cleared by software. When this bit is set, an interrupt is generated if the OVRUDR bit in the SAI_xSR register is set. **/
#define SAI3_SAI_BIM_OVRUDRIE		(1 << 0)

/**@}*/

/** @defgroup sai3_sai_bsr SAIBSR Status register
@{*/


#define SAI3_SAI_BSR_FLVL_SHIFT		16
#define SAI3_SAI_BSR_FLVL_MASK		0x07
/** @defgroup sai3_sai_bsr_flvl FLVL FIFO level threshold. This bit is read only. The FIFO level threshold flag is managed only by hardware and its setting depends on SAI block configuration (transmitter or receiver mode). If the SAI block is configured as transmitter: If SAI block is configured as receiver:
@{*/
/**@}*/

/** SAI3_SAI_BSR_LFSDET Late frame synchronization detection. This bit is read only. This flag can be set only if the audio block is configured in slave mode. It is not used in AC97 or SPDIF mode. It can generate an interrupt if LFSDETIE bit is set in the SAI_xIM register. This flag is cleared when the software sets bit CLFSDET in SAI_xCLRFR register **/
#define SAI3_SAI_BSR_LFSDET		(1 << 6)
/** SAI3_SAI_BSR_AFSDET Anticipated frame synchronization detection. This bit is read only. This flag can be set only if the audio block is configured in slave mode. It is not used in AC97or SPDIF mode. It can generate an interrupt if AFSDETIE bit is set in SAI_xIM register. This flag is cleared when the software sets CAFSDET bit in SAI_xCLRFR register. **/
#define SAI3_SAI_BSR_AFSDET		(1 << 5)
/** SAI3_SAI_BSR_CNRDY Codec not ready. This bit is read only. This bit is used only when the AC97 audio protocol is selected in the SAI_xCR1 register and configured in receiver mode. It can generate an interrupt if CNRDYIE bit is set in SAI_xIM register. This flag is cleared when the software sets CCNRDY bit in SAI_xCLRFR register. **/
#define SAI3_SAI_BSR_CNRDY		(1 << 4)
/** SAI3_SAI_BSR_FREQ FIFO request. This bit is read only. The request depends on the audio block configuration: If the block is configured in transmission mode, the FIFO request is related to a write request operation in the SAI_xDR. If the block configured in reception, the FIFO request related to a read request operation from the SAI_xDR. This flag can generate an interrupt if FREQIE bit is set in SAI_xIM register. **/
#define SAI3_SAI_BSR_FREQ		(1 << 3)
/** SAI3_SAI_BSR_WCKCFG Wrong clock configuration flag. This bit is read only. This bit is used only when the audio block operates in master mode (MODE[1] = 0) and NODIV = 0. It can generate an interrupt if WCKCFGIE bit is set in SAI_xIM register. This flag is cleared when the software sets CWCKCFG bit in SAI_xCLRFR register. **/
#define SAI3_SAI_BSR_WCKCFG		(1 << 2)
/** SAI3_SAI_BSR_MUTEDET Mute detection. This bit is read only. This flag is set if consecutive 0 values are received in each slot of a given audio frame and for a consecutive number of audio frames (set in the MUTECNT bit in the SAI_xCR2 register). It can generate an interrupt if MUTEDETIE bit is set in SAI_xIM register. This flag is cleared when the software sets bit CMUTEDET in the SAI_xCLRFR register. **/
#define SAI3_SAI_BSR_MUTEDET		(1 << 1)
/** SAI3_SAI_BSR_OVRUDR Overrun / underrun. This bit is read only. The overrun and underrun conditions can occur only when the audio block is configured as a receiver and a transmitter, respectively. It can generate an interrupt if OVRUDRIE bit is set in SAI_xIM register. This flag is cleared when the software sets COVRUDR bit in SAI_xCLRFR register. **/
#define SAI3_SAI_BSR_OVRUDR		(1 << 0)

/**@}*/

/** @defgroup sai3_sai_bclrfr SAIBCLRFR Clear flag register
@{*/

/** SAI3_SAI_BCLRFR_CLFSDET Clear late frame synchronization detection flag. This bit is write only. Programming this bit to 1 clears the LFSDET flag in the SAI_xSR register. This bit is not used in AC97or SPDIF mode Reading this bit always returns the value 0. **/
#define SAI3_SAI_BCLRFR_CLFSDET		(1 << 6)
/** SAI3_SAI_BCLRFR_CAFSDET Clear anticipated frame synchronization detection flag. This bit is write only. Programming this bit to 1 clears the AFSDET flag in the SAI_xSR register. It is not used in AC97or SPDIF mode. Reading this bit always returns the value 0. **/
#define SAI3_SAI_BCLRFR_CAFSDET		(1 << 5)
/** SAI3_SAI_BCLRFR_CCNRDY Clear Codec not ready flag. This bit is write only. Programming this bit to 1 clears the CNRDY flag in the SAI_xSR register. This bit is used only when the AC97 audio protocol is selected in the SAI_xCR1 register. Reading this bit always returns the value 0. **/
#define SAI3_SAI_BCLRFR_CCNRDY		(1 << 4)
/** SAI3_SAI_BCLRFR_CWCKCFG Clear wrong clock configuration flag. This bit is write only. Programming this bit to 1 clears the WCKCFG flag in the SAI_xSR register. This bit is used only when the audio block is set as master (MODE[1] = 0) and NODIV = 0 in the SAI_xCR1 register. Reading this bit always returns the value 0. **/
#define SAI3_SAI_BCLRFR_CWCKCFG		(1 << 2)
/** SAI3_SAI_BCLRFR_CMUTEDET Mute detection flag. This bit is write only. Programming this bit to 1 clears the MUTEDET flag in the SAI_xSR register. Reading this bit always returns the value 0. **/
#define SAI3_SAI_BCLRFR_CMUTEDET		(1 << 1)
/** SAI3_SAI_BCLRFR_COVRUDR Clear overrun / underrun. This bit is write only. Programming this bit to 1 clears the OVRUDR flag in the SAI_xSR register. Reading this bit always returns the value 0. **/
#define SAI3_SAI_BCLRFR_COVRUDR		(1 << 0)

/**@}*/

